In [4]:
## NBA선수 데이터
import pandas as pd
import numpy as np

pd.set_option('display.max_columns',50)
df = pd.read_csv("https://raw.githubusercontent.com/Datamanim/datarepo/main/nba/nba.csv",encoding='latin',sep=';')

In [7]:
#1. Tm 컬럼은 각 팀의 이름을 의미한다. TOR팀의 평균나이를 소수 4째 자리까지 구하여라

np.round(df[df['Tm'] == "TOR"]['Age'].mean(),4)

24.8696

In [19]:
#2. Pos 컬럼은 포지션을 의미한다. 전체 선수 중 최소나이대의 선수들을 필터하고 그들 중 가장 많은 포지션은 무엇인지 확인하라
df[df['Age'] == df['Age'].min()]['Pos'].value_counts().index[0]

'SG'

In [30]:
#3. 선수들의 이름은 first_name+ 공백 + last_name으로 이루어져 있다. 가장 많은 first_name은 무엇이며 몇 회 발생하는지 확인하라
df['Player'].apply(lambda x : x.split(" ")[0]).value_counts().head(1)

Justin    14
Name: Player, dtype: int64

In [35]:
#4. PTS컬럼은 경기당 평균득점수 이다. 각포지션별로 경기당 평균득점수의 평균을 구하여라
df.groupby("Pos").mean()['PTS'].sort_values(ascending=False)

Pos
PG-SG    22.000000
C-PF     12.850000
SG-PG     9.525000
SF-SG     8.660000
PF-SF     8.500000
PG        8.325161
SG        7.810553
PF        7.737500
C         7.690769
SG-SF     7.360000
SF        7.270253
Name: PTS, dtype: float64

In [43]:
#5. G컬럼은 참여한 경기의 숫자이다. 각 팀별로 가장 높은 경기참여 수를 가진 선수들의 경기 참여 숫자의 평균을 구하여라
np.round(df.groupby("Tm").max()['G'].mean(),4)

77.5161

In [48]:
#6. Tm의 값이 MIA이며 Pos는 C또는 PF인 선수의 MP값의 평균은?

target = df[df['Tm']=="MIA"]
np.round(target[(target['Pos'] == "C") | (target['Pos'] == "PF")]['MP'].mean(),4)

16.7875

In [50]:
# 7. 전체 데이터중 G의 평균값의 1.5배 이상인 데이터들만 추출했을때 3P값의 평균은?
np.round(df[df['G']>=1.5*df['G'].mean()]['3P'].mean(),4)

1.3854

In [51]:
# 8. Age의 평균 이상인 그룹과 평균 미만인 그룹간의 G값의 평균의 차이는?
below_mean = df[df['Age']>=df['Age'].mean()]
upper_mean = df[df['Age']<df['Age'].mean()]
np.round(np.abs(below_mean['G'].mean() - upper_mean['G'].mean()),4)

3.7877

In [64]:
# 9. 평균나이가 가장 젊은 팀은 어디인가
df.groupby("Tm").mean()['Age'].sort_values(ascending= True).head(1).index[0]

'MEM'

In [65]:
# 10. Pos그룹별 평균 MP값을 구하여라
df.groupby("Pos").mean()['MP']

Pos
C        16.990000
C-PF     25.350000
PF       17.937500
PF-SF    27.300000
PG       19.547742
PG-SG    37.200000
SF       17.514557
SF-SG    20.340000
SG       18.554271
SG-PG    22.950000
SG-SF    19.620000
Name: MP, dtype: float64

In [66]:
#자동차 보험가입 예측데이터 
import pandas as pd
df = pd.read_csv("https://raw.githubusercontent.com/Datamanim/datarepo/main/insurance/train.csv")
df.head()

,id,Gender,Age,Driving_License,Region_Code,Previously_Insured,Vehicle_Age,Vehicle_Damage,Annual_Premium,Policy_Sales_Channel,Vintage,Response
0,188957,Female,25,1,17.0,1,< 1 Year,No,38785.0,152.0,59,0
1,275631,Male,20,1,22.0,0,< 1 Year,No,2630.0,160.0,113,0
2,329036,Female,40,1,41.0,0,1-2 Year,Yes,33165.0,124.0,188,0
3,227288,Female,28,1,30.0,1,< 1 Year,No,29038.0,152.0,233,0
4,300441,Female,50,1,28.0,0,1-2 Year,Yes,31325.0,124.0,258,0

In [86]:
#1.Vehicle_Age 값이 2년 이상인 사람들만 필터링 하고 그중에서
#  Annual_Premium 값이 전체 데이터의 중간값 이상인 사람들을 찾고, 그들의 Vintage값의 평균을 구하여라
median = df['Vintage'].median()
target_df = df[df['Vehicle_Age']==df['Vehicle_Age'].unique()[2]]
np.round(target_df[target_df['Annual_Premium']>=median]['Vintage'].mean(),4)

154.7757

In [98]:
#2. vehicle_age에 따른 각 성별(gender)그룹의 Annual_Premium값의 평균을 구하여 아래 테이블과 동일하게 구현하라
df.groupby(["Vehicle_Age","Gender"])['Annual_Premium'].mean()

Vehicle_Age  Gender
1-2 Year     Female    30762.245001
             Male      30413.088469
< 1 Year     Female    29972.286702
             Male      30310.982212
> 2 Years    Female    36108.366374
             Male      35303.870627
Name: Annual_Premium, dtype: float64

In [99]:
df.groupby(['Gender','Vehicle_Age'],as_index = False)['Annual_Premium'].mean()

   Gender Vehicle_Age  Annual_Premium
0  Female    1-2 Year    30762.245001
1  Female    < 1 Year    29972.286702
2  Female   > 2 Years    36108.366374
3    Male    1-2 Year    30413.088469
4    Male    < 1 Year    30310.982212
5    Male   > 2 Years    35303.870627

In [100]:
df

,id,Age,Driving_License,Region_Code,Previously_Insured,Annual_Premium,Policy_Sales_Channel,Vintage,Response
count,304887.000000,304887.000000,304887.000000,304887.000000,304887.000000,304887.000000,304887.000000,304887.000000,304887.000000
mean,190603.266174,38.828304,0.997898,26.382650,0.458258,30576.579598,112.044954,154.319466,0.122563
std,110023.298778,15.504898,0.045804,13.236626,0.498255,17265.678980,54.198329,83.625500,0.327936
min,1.000000,20.000000,0.000000,0.000000,0.000000,2630.000000,1.000000,10.000000,0.000000
25%,95239.500000,25.000000,1.000000,15.000000,0.000000,24414.500000,29.000000,82.000000,0.000000
50%,190666.000000,36.000000,1.000000,28.000000,0.000000,31663.000000,133.000000,154.000000,0.000000
75%,285948.500000,49.000000,1.000000,35.000000,1.000000,39410.000000,152.000000,227.000000,0.000000
max,381108.000000,85.000000,1.000000,52.000000,1.000000,540165.000000,163.000000,299.000000,1.000000